package hometasks.lesson10.lvlA.task1;

import java.util.ArrayList;

/*Создать список ArrayList который хранит в себе все цвета радуги. Вывести их в консоль.*/

public class Run {
    public static void main(String[] args) {
        ArrayList<String> rainbow = new ArrayList<>();
        rainbow.add("Red");
        rainbow.add("Yellow");
        System.out.println(rainbow);
    }
}
